---
kind: property
id: P:Autodesk.Revit.DB.InSessionViewSheetSet.SheetOrganizationId
source: html/54e9ea27-21d1-5fd7-114b-25b3b6854cfe.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet.SheetOrganizationId Property

ElementId to the BrowserOrganization for sheets.

## Syntax (C#)
```csharp
public virtual ElementId SheetOrganizationId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the ElementId does not reference to BrowserOrganization , or the target type of BrowserOrganization is incompatible.